"""
С клавиатуры вводится два числа K и N. 
Квадратная матрица А(N,N), состоящая из 4-х равных по размерам подматриц, B,C,D,E заполняется случайным образом целыми числами в интервале [-10,10]. 
Для тестирования использовать не случайное заполнение, а целенаправленное.

Для ИСТд-13 вид матрицы А
D	Е
С	В

Для ИСТд-13
  4
3   1
  2

8. Формируется матрица F следующим образом: 
если в С количество простых чисел в нечетных столбцах в области 2 больше, 
чем количество нулевых  элементов в четных строках в области 3, 
то поменять в С симметрично области 1 и 3 местами, 
иначе С и В поменять местами несимметрично. 
При этом матрица А не меняется. 
После чего вычисляется выражение: ((К*A)*F– (K * AT) . 
Выводятся по мере формирования А, F и все матричные операции последовательно.
"""
